import { Component } from '@angular/core';

@Component({
    selector: 'fourth-home-part',
    template: `
    <div class="fourth-home-part">

        <div class="take-specialist-container">
            <div class="take-specialist-body">
                <div class="take-specialist-body-title">
                Не чекай, щоб зміни почалися. Почни свій шлях до щасливого життя з <span [style]="{'color':'#3ECD96'}">Talkind</span>. 
                </div>
                <button>Підібрати фахівця</button>
            </div>
        </div>    

        <div class="cards-container">

            <div class="card">
                <div class="card-img">
                    <img src="assets/img/home-page/card-img.png" alt="card-img">
                </div>
                <div class="card-body">
                    <div class="card-body-title">
                        Психолог, психотерапевт або психіатр. До кого звернутись?
                    </div>
                    <div class="card-body-text">
                        Розуміння основних відмінностей між цими спеціалізаціями може допомогти вам зробити вірний вибір і звернутися до того фахівця, який найбільше відповідає вашим потребам.
                    </div>
                </div>
                <div class="card-footer">
                    <span>До кого звернутись</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="15" viewBox="0 0 30 15" fill="none">
                      <path d="M29.8778 6.90982C29.8747 6.90262 29.8709 6.8957 29.8678 6.88857C29.852 6.85348 29.8358 6.81868 29.8172 6.78461C29.803 6.75819 29.787 6.73293 29.7712 6.70745C29.7627 6.69369 29.755 6.67957 29.7459 6.66603C29.6776 6.56354 29.5972 6.46956 29.5064 6.38612L23.5263 0.443608C22.931 -0.147869 21.9694 -0.147869 21.3741 0.443608C20.7788 1.03509 20.7788 1.99055 21.3741 2.58203L24.792 5.97875L1.52634 5.97816C0.686865 5.97816 0 6.66064 0 7.49475C0 8.32893 0.686865 9.01133 1.52634 9.01133L24.792 9.01184L21.3603 12.4217C20.7649 13.0132 20.7649 13.9687 21.3603 14.5602C21.6655 14.8483 22.047 15 22.4439 15C22.8408 15 23.2223 14.8483 23.5276 14.5602L29.5543 8.57208C30.0075 8.12175 30.1146 7.46083 29.8778 6.90982Z"/>
                    </svg>
                </div>
            </div>

            <div class="card">
                <div class="card-img">
                    <img src="assets/img/home-page/card-img.png" alt="card-img">
                </div>
                <div class="card-body">
                    <div class="card-body-title">
                        Як вибрати психотерапевта, який вас зрозуміє?
                    </div>
                    <div class="card-body-text">
                        Вибір правильного психотерапевта може бути важливим етапом у цьому процесі. Як знайти того, хто зможе допомогти вам знайти власний внутрішній баланс і вирішити проблеми?
                    </div>
                </div>
                <div class="card-footer">
                    <span>Як обрати терапевта</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="15" viewBox="0 0 30 15" fill="none">
                      <path d="M29.8778 6.90982C29.8747 6.90262 29.8709 6.8957 29.8678 6.88857C29.852 6.85348 29.8358 6.81868 29.8172 6.78461C29.803 6.75819 29.787 6.73293 29.7712 6.70745C29.7627 6.69369 29.755 6.67957 29.7459 6.66603C29.6776 6.56354 29.5972 6.46956 29.5064 6.38612L23.5263 0.443608C22.931 -0.147869 21.9694 -0.147869 21.3741 0.443608C20.7788 1.03509 20.7788 1.99055 21.3741 2.58203L24.792 5.97875L1.52634 5.97816C0.686865 5.97816 0 6.66064 0 7.49475C0 8.32893 0.686865 9.01133 1.52634 9.01133L24.792 9.01184L21.3603 12.4217C20.7649 13.0132 20.7649 13.9687 21.3603 14.5602C21.6655 14.8483 22.047 15 22.4439 15C22.8408 15 23.2223 14.8483 23.5276 14.5602L29.5543 8.57208C30.0075 8.12175 30.1146 7.46083 29.8778 6.90982Z"/>
                    </svg>
                </div>
            </div>

            <div class="card">
                <div class="card-img">
                    <img src="assets/img/home-page/card-img.png" alt="card-img">
                </div>
                <div class="card-body">
                    <div class="card-body-title">
                        Різниця між терапевтичними підходами у психотерапії
                    </div>
                    <div class="card-body-text">
                        Різноманіття терапевтичних підходів може здатися заплутаним для тих, хто тільки починає свій шлях до розв'язання психологічних проблем і покращення психічного благополуччя. 
                    </div>
                </div>
                <div class="card-footer">
                    <span>Як обрати підхід</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="15" viewBox="0 0 30 15" fill="none">
                      <path d="M29.8778 6.90982C29.8747 6.90262 29.8709 6.8957 29.8678 6.88857C29.852 6.85348 29.8358 6.81868 29.8172 6.78461C29.803 6.75819 29.787 6.73293 29.7712 6.70745C29.7627 6.69369 29.755 6.67957 29.7459 6.66603C29.6776 6.56354 29.5972 6.46956 29.5064 6.38612L23.5263 0.443608C22.931 -0.147869 21.9694 -0.147869 21.3741 0.443608C20.7788 1.03509 20.7788 1.99055 21.3741 2.58203L24.792 5.97875L1.52634 5.97816C0.686865 5.97816 0 6.66064 0 7.49475C0 8.32893 0.686865 9.01133 1.52634 9.01133L24.792 9.01184L21.3603 12.4217C20.7649 13.0132 20.7649 13.9687 21.3603 14.5602C21.6655 14.8483 22.047 15 22.4439 15C22.8408 15 23.2223 14.8483 23.5276 14.5602L29.5543 8.57208C30.0075 8.12175 30.1146 7.46083 29.8778 6.90982Z"/>
                    </svg>
                </div>
            </div>

        </div>
    </div>
    `,
    styleUrls: ["./fourth-home-part.scss"]
})
export class FourthHomePartComponent {
    constructor() { }
}